import 'dart:math';

import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:email_validator/email_validator.dart';
import 'package:firebase_auth/firebase_auth.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/widgets.dart';
import 'package:flutter_eapp/Provider/modelhut.dart';
import 'package:flutter_eapp/constants.dart';
import 'package:flutter_eapp/services/auth.dart';
import 'package:flutter_eapp/services/store.dart';
import 'package:fluttertoast/fluttertoast.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:modal_progress_hud/modal_progress_hud.dart';
import 'package:provider/provider.dart';
import 'package:rflutter_alert/rflutter_alert.dart';
import 'package:sms_autofill/sms_autofill.dart';

import 'home.dart';
import 'loginsccreen.dart';

class Signupscreen extends StatefulWidget {
  static String id = 'signupscreen';
  final auth = Auth();
  final store = Store();
  User firebaseUser;
  final FirebaseFirestore firestore = FirebaseFirestore.instance;

  @override
  _SignupscreenState createState() => _SignupscreenState();
}

class _SignupscreenState extends State<Signupscreen> {
  var email = TextEditingController();
  var password = TextEditingController();
  var username = TextEditingController();
  var phone = TextEditingController();
  final FirebaseAuth _auth = FirebaseAuth.instance;

  final _scaffoldKey = GlobalKey<ScaffoldState>();
  final TextEditingController _smsController = TextEditingController();
  String _verificationId;
  final SmsAutoFill _autoFill = SmsAutoFill();

  var verifycode;

  String ava;

  get auth => widget.auth;

  get firebaseUser => widget.firebaseUser;

  get firestore => FirebaseFirestore.instance;

  Widget _backButton() {
    return InkWell(
      onTap: () {
        Navigator.pop(context);
      },
      child: Container(
        padding: EdgeInsets.symmetric(horizontal: 10),
        child: Row(
          children: <Widget>[
            Container(
              padding: EdgeInsets.only(left: 0, top: 10, bottom: 10),
              child: Icon(Icons.keyboard_arrow_left, color: Colors.black),
            ),
            Text('رجوع',
                style: TextStyle(fontSize: 12, fontWeight: FontWeight.w500))
          ],
        ),
      ),
    );
  }

  Widget _entryField(String title, {bool isPassword = false, controller}) {
    return Container(
      margin: EdgeInsets.symmetric(vertical: 10),
      child: Column(
        crossAxisAlignment: CrossAxisAlignment.end,
        children: <Widget>[
          Text(
            title,
            style: TextStyle(fontWeight: FontWeight.bold, fontSize: 15),
          ),
          SizedBox(
            height: 10,
          ),
          TextField(

            obscureText: isPassword,
            decoration: InputDecoration(
                border: InputBorder.none,
                fillColor: Color(0xfff3f3f4),
                filled: true),
            controller: controller,
          )
        ],
      ),
    );
  }

  Widget _submitButton() {
    return Container(
      width: MediaQuery.of(context).size.width,
      padding: EdgeInsets.symmetric(vertical: 15),
      alignment: Alignment.center,
      decoration: BoxDecoration(
          borderRadius: BorderRadius.all(Radius.circular(5)),
          boxShadow: <BoxShadow>[
            BoxShadow(
                color: Colors.grey.shade200,
                offset: Offset(2, 4),
                blurRadius: 5,
                spreadRadius: 2)
          ],
          gradient: LinearGradient(
              begin: Alignment.centerLeft,
              end: Alignment.centerRight,
              colors: [klight, kdark])),
      child: GestureDetector(
        onTap: () {
          VerifyAlert(context, "سياسة الخصوصية والشروط والأحكام", ""
              " بالضغط علي موافق فأنت تقر بموافقتك على كل الشروط والأحكام وسياسة الخصوصية", phone);
        },
        child: Text(
          'التسجيل الان',
          style: TextStyle(fontSize: 20, color: Colors.white),
        ),
      ),
    );
  }

  Widget _loginAccountLabel() {
    return InkWell(
      onTap: () {
        Navigator.push(
            context, MaterialPageRoute(builder: (context) => LoginScreen()));
      },
      child: Container(
        margin: EdgeInsets.symmetric(vertical: 20),
        padding: EdgeInsets.all(15),
        alignment: Alignment.bottomCenter,
        child: Row(
          mainAxisAlignment: MainAxisAlignment.center,
          children: <Widget>[
            Text(
              'تسجيل الدخول',
              style: TextStyle(
                  color: kdark, fontSize: 13, fontWeight: FontWeight.w600),
            ),
            SizedBox(
              width: 10,
            ),
            Text(
              'لديك حساب بالفعل ؟',
              style: TextStyle(fontSize: 13, fontWeight: FontWeight.w600),
            ),
          ],
        ),
      ),
    );
  }

  Widget _title() {
    return Center(
      child: RichText(
        textAlign: TextAlign.center,
        text: TextSpan(
            text: 'Ca',
            style: GoogleFonts.portLligatSans(
              textStyle: Theme.of(context).textTheme.display1,
              fontSize: 30,
              fontWeight: FontWeight.w700,
              color: kdark,
            ),
            children: [
              TextSpan(
                text: 'ram',
                style: TextStyle(color: Colors.black, fontSize: 30),
              ),
              TextSpan(
                text: 'ella',
                style: TextStyle(color: kdark, fontSize: 30),
              ),
            ]),
      ),
    );
  }

  Widget _emailPasswordWidget() {
    return Column(
      children: <Widget>[
        _entryField("اسم المستخدم", isPassword: false, controller: username),
         Container(
    margin: EdgeInsets.symmetric(vertical: 10),
    child: Column(
    crossAxisAlignment: CrossAxisAlignment.end,
    children: <Widget>[
    Text(
    "رقم الهاتف",
    style: TextStyle(fontWeight: FontWeight.bold, fontSize: 15),
    ),
    SizedBox(
    height: 10,
    ),
    TextField(
      keyboardType: TextInputType.phone,
      maxLength: 9,
    obscureText: false,
    decoration: InputDecoration(
    prefix: Text("+962"),
    border: InputBorder.none,
    fillColor: Color(0xfff3f3f4),
    filled: true),
    controller: phone,
    )
    ],
    ),
    ),
    Container(
    margin: EdgeInsets.symmetric(vertical: 10),
    child: Column(
    crossAxisAlignment: CrossAxisAlignment.end,
    children: <Widget>[



      Text(
    "البريد الألكتروني",
    style: TextStyle(fontWeight: FontWeight.bold, fontSize: 15),
    ),
    SizedBox(
    height: 10,
    ),
    TextFormField(
      validator: (value) => EmailValidator.validate(value) ? sendverifyemail(email) :"أدخل إيميل صالح",
      decoration: InputDecoration(
    border: InputBorder.none,
    fillColor: Color(0xfff3f3f4),
    filled: true),
    controller: email,
    )
    ],
    ),
    ),
        _entryField("كلمه السر", isPassword: true, controller: password),
      ],
    );
  }

  @override
  Widget build(BuildContext context) {
    final height = MediaQuery.of(context).size.height;
    return ModalProgressHUD(
      progressIndicator: const CircularProgressIndicator(
        strokeWidth: 0.5,
      ),
      inAsyncCall: Provider.of<Modelhut>(context).isLoading,
      child: Scaffold(
        body: Container(
          height: height,
          child: Stack(
            children: <Widget>[
              Positioned(
                top: -MediaQuery.of(context).size.height * .15,
                right: -MediaQuery.of(context).size.width * .4,
                child: BezierContainer(),
              ),
              Container(
                padding: EdgeInsets.symmetric(horizontal: 20),
                child: SingleChildScrollView(
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.center,
                    mainAxisAlignment: MainAxisAlignment.center,
                    children: <Widget>[
                      SizedBox(height: height * .2),
                      _title(),
                      SizedBox(
                        height: 50,
                      ),
                      _emailPasswordWidget(),
                      SizedBox(
                        height: 20,
                      ),
                      _submitButton(),
                      SizedBox(height: height * .14),
                      _loginAccountLabel(),
                    ],
                  ),
                ),
              ),
              Positioned(top: 40, left: 0, child: _backButton()),
            ],
          ),
        ),
      ),
    );
  }

  @override
  void initState() {
    print(ava);
  }

  void signup() async {
    final model = Provider.of<Modelhut>(context, listen: false);

    model.changeisLoading(true);

    User firebaseUser;

    if (password.text.isEmpty ||
        email.text.isEmpty ||
        username.text.isEmpty ||
        phone.text.isEmpty) {
      model.changeisLoading(false);

      Fluttertoast.showToast(
          msg: "من فضلك اكمل كل الحقول الفارغه",
          toastLength: Toast.LENGTH_SHORT,
          gravity: ToastGravity.BOTTOM,
          timeInSecForIosWeb: 1,
          backgroundColor: kdark,
          textColor: Colors.white,
          fontSize: 16.0);
    } else
      try {
        final AuthResult = await auth
            .signUp(email.text.trim(), password.text.trim())
            .then((auth) =>
        firebaseUser = auth.user



        );


        if (firebaseUser != null) {
          await firestore
              .collection('Users')
              .doc(firebaseUser.uid)
              .collection('Userdata')
              .doc(firebaseUser.uid)
              .set({
            'uid': firebaseUser.uid,
            'Email': firebaseUser.email,
            'name': username.text.trim(),
            'FirstTime': 'Yes',
            'AreaCode': 'Not Set',
            'Address': 'Not Set',
            "Time": DateTime.now(),
            "Points": 5,
            'Phone': '+962${phone.text}'.trim(),
            'emailverified' : "No",
            "phoneverified" : "No",
            'photo':
                'https://image.shutterstock.com/image-vector/man-icon-vector-260nw-1040084344.jpg',
          });
          await firestore.collection('UserReports').doc(firebaseUser.uid).set({
            'uid': firebaseUser.uid,
            'Email': firebaseUser.email,
            'name': username.text.trim(),
            "Time": DateTime.now(),
            'Phone': '+962${phone.text}'.trim(),
            'photo':
                'https://image.shutterstock.com/image-vector/man-icon-vector-260nw-1040084344.jpg',
            "AskedOrders": 0,
            "CancelledOrders": 0,
            "CompletedOrders": 0,
          });

          await firestore
              .collection('Sellers')
              .doc(
            '+962${phone.text}'.trim(),
              )
              .set({
            'name': username.text.trim(),
            'Phone': '+962${phone.text}'.trim(),
          });
        }
        model.changeisLoading(false);

        Navigator.pushReplacementNamed(context, Home.id);
      } catch (e) {
        model.changeisLoading(false);
print (e.toString()+'لخطااا  + ');

      }
  }

  VerifyAlert(BuildContext context, title, desc, phone) async {
    final bool isValid = EmailValidator.validate( email.text);


if (isValid == false){{


  Fluttertoast.showToast(
      msg: "الايميل المدخل غير صحيح",
      toastLength: Toast.LENGTH_SHORT,
      gravity: ToastGravity.BOTTOM,
      timeInSecForIosWeb: 1,
      backgroundColor: kdark,
      textColor: Colors.white,
      fontSize: 16.0);
}}




    if (password.text.isEmpty ||
        email.text.isEmpty ||
        username.text.isEmpty ||
        phone.text.isEmpty
    ) {


      Fluttertoast.showToast(
          msg: "من فضلك اكمل كل الحقول الفارغه",
          toastLength: Toast.LENGTH_SHORT,
          gravity: ToastGravity.BOTTOM,
          timeInSecForIosWeb: 1,
          backgroundColor: kdark,
          textColor: Colors.white,
          fontSize: 16.0);
    }


    if (password.text.isNotEmpty &&
        email.text.isNotEmpty &&
        username.text.isNotEmpty &&
        phone.text.isNotEmpty &&isValid == true ){
      {
        print("phone  : " + phone.text.toString());

        var usersRef =
        await firestore.collection('Sellers').doc('+962${phone.text}'.trim());

        AlertStyle alertStyle;
        usersRef.get().then((docSnapshot) => {
          if (docSnapshot.exists)
            {
              Fluttertoast.showToast(
                  msg: "تم التسجيل بهذا الرقم بالفعل",
                  toastLength: Toast.LENGTH_LONG,
                  gravity: ToastGravity.BOTTOM,
                  timeInSecForIosWeb: 1,
                  backgroundColor: kdark,
                  textColor: Colors.white,
                  fontSize: 16.0)
            }
          else
            {
              alertStyle = AlertStyle(
                animationType: AnimationType.shrink,
                isCloseButton: false,
                isOverlayTapDismiss: false,
                descStyle: TextStyle(fontWeight: FontWeight.bold),
                animationDuration: Duration(milliseconds: 250),
                alertBorder: RoundedRectangleBorder(
                  borderRadius: BorderRadius.circular(8.0),
                  side: BorderSide(
                    color: Colors.grey,
                  ),
                ),
                titleStyle: TextStyle(color: Colors.black),
              )
            },
          Alert(
              context: context,
              style: alertStyle,
              title: title,
              desc: desc,
              buttons: [
                DialogButton(
                    child: Text(
                      "لا أوافق",
                      style: TextStyle(color: Colors.white, fontSize: 20),
                    ),
                    onPressed: () {
                      Navigator.pop(context);
                    },
                    color: Colors.blueGrey),
                DialogButton(
                    child: Text(
                      "موافق",
                      style: TextStyle(color: Colors.white, fontSize: 20),
                    ),
                    onPressed: () =>
                         signup()


                   ),
              ],


            content: Container(

              height: MediaQuery.of(context).size.width*1.2,
              width: MediaQuery.of(context).size.width*1.9,
              child:

            SingleChildScrollView(

              child: Column(
                children: [Text(


                  """
                  لكي تصبح عضواً في تطبيق كاراميلا على الشبكة، يتعين عليك في البداية أن تقوم بتعبئة استمارة التسجيل، ثم الموافقة والتعهد على الالتزام بأحكام إتفاقية مستخدم تطبيق كاراميلا، وعند تعبئة واعتماد استمارة التسجيل أو الحصول على أية خدمات أو طلب غرض باستخدام التطبيق؛ فإنك بموجب هذا توافق على الالتزام باتفاقية مستخدم تطبيق كاراميلا.
* انت مسؤول عن اجراء كافة الترتيبات اللازمة لكي تقوم بالولوج الى التطبيق على الشبكة، كما أنك مسؤول أيضا عن ضمان أن كافة الاشخاص الذين يدخلون إلى التطبيق عن طريق وصلة الانترنت الخاصة بك على علم بشروط هذا التطبيق، والتزامهم بها. وعند عرض أو تصفح أو استخدام أو الدخول الى التطبيق أو تقديم أي محتوى أو مواد الى التطبيق، فإنك توافق على شروط الاستخدام الماثلة كاتفاق قانوني ملزم بينك وبين تطبيق كاراميلا بدون قيد او شرط. ان مصطلح "أنت" سوف يشير الى أي شخص او كيان يقوم بعرض أو استخدام أو الدخول أو تصفح التطبيق أو تقديم أي محتوى أو مواد إلى التطبيق. في حالة عدم موافقتك على شروط الاستخدام الماثلة، فلا يجوز لك استخدام التطبيق. تحتفظ تطبيق كاراميلا بحق تعديل شروط الاستخدام الماثلة في أي وقت وبدون اشعار مسبق، وأنك توافق على أن كل زيارة تقوم بها إلى المواقع سوف تخضع إلى شروط الاستخدام السارية المفعول في ذلك الوقت، وأن استمرار إستخدام التطبيق الآن أو بعد التعديلات على شروط الاستخدام الماثلة يؤكد على أنك قمت بقراءة وقبول والموافقة على الالتزام بهذه التعديلات.

هذه الشروط والأحكام تطبق على تطبيق كاراميلا وجميع تطبيقاته على أجهزة الآيفون، الآيباد، الأندرويد والهاتف المتصل بمتصفح الإنترنت
سمح تطبيق كاراميلا لأعضاءها الذين يوافقون على الاتفاقية بالطلب من المحلات عبر تطبيقها على الانترنت.
تقدم لك تطبيق كاراميلا طريقة سهلة لإيصال طلباتك إلى المحلات التي يتم عرضها على التطبيق على الشبكة
إن غرض هذا التطبيق هو تقديم خدمة بسيطة ومريحة الى العملاء وربطهم بالمحلات في منطقتهم التي يمكنها تقديم كل ما يلزم الجمال والعناية بالبشرة
لقد أنشأنا التطبيق ليكون مجمع الكتروني شامل لمحلات المكياج والاكسسوارات والمتاجر  وتطبيق كاراميلا عبارة عن تطبيق الكتروني تجاري لتوصيل طلبات المحلات من خلال الإنترنت
ان تطبيق كاراميلا لا يقوم بالبيع أو التدخل بأي شكل من الأشكال في انتاج أو تصنيع أو إعداد أي بضاعة يتم انتاجه في المحلات ، وإن ما يقدمه هذا السوق عبر الإنترنت إلى المستخدمين هو فقط توفير إمكانية البحث والعثور على المحلات المحلية او المتاجر الالكترونية المشتركة في التطبيق، التي تقوم بتوفير وتوصيل المكياج والاكسسوارات وما يلزم للجمال إلى عناوينهم والطلب من خلاله. وإن هذه المحلات مسئولة بمفردها عن الإلتزام بالقوانين واللوائح والانظمة والمقاييس والمعايير المطبقة 
إلا أنه من الأهمية بمكان أن يفهم المستخدمين أن تطبيق كاراميلا لا تؤكد بأي شكل وعلى نحو مستقل على اعتماد والتعهد بمنتجات المحلات أو مكونات أو نوعية أية منتجات أو أن المحل يلتزم بالقوانين واللوائح المعمول بها ,حيث أن هذه المسئولية تقع على عاتق المحل بمفرده. يتعين على المشترين الاطلاع على المعلومات المقدمة من المحلات على التطبيق على الشبكة أو التي يطلبها المشترون مباشرة من المحلات من حيث نوعية البضاعة وموثوقية المحل، وكذلك التزامه بالقوانين واللوائح المعمول بها
ولا تضمن تطبيق كاراميلا بأي طريقة كانت نوعية أي غرض وجودته، أو أن البضاعة غير متوافقة مع القوانين واللوائح المعمول بها، كما لاتضمن مطابقة قائمة البضاعة المعروضة على التطبيق لما هو يقدم فعلياً للمستخدمين
علاوة على ذلك، قد يتعهد المحل بأن تحضير مستحضرات الجمال يتم وفقاً للمقاييس الخاصة مثل معايير "الجليسترين"،او معايير ذات حساسية خاصة ومع ذلك، لا تقوم تطبيق كاراميلا على نحو مستقل بالتحقق أو التأكد من هذه التعهدات
إن تطبيق كاراميلا لن تكون ملزمة او مسؤولة عن أي بضاعة او خدمات مقدمة من المحلات التي تكون غير صحية، وتتسبب في الاصابة أو تكون غير مقبولة للمشترين، أو التي لا تلبي توقعات المشترين بأي طريقة
إن المشترين وحدهم مسؤولين عن التأكد من صحة عناوين التوصيل ولن يكون على تطبيق كاراميلا أي التزام أو مسؤولية عن أية عناوين خاطئة. إن كافة عمليات تحضير و وجود البضاعة هي مسؤولية المحل الذي يقبل الطلبية. مع العلم بأن المحل سوف يقوم باتخاذ كافة الوسائل الممكنة التي يمكنه القيام بها للوفاء بوقت التوصيل المحدد، ومع ذلك قد يتأثر وقت التوصيل بعوامل خارج سيطرته ولذلك لا يمكن ضمانها. وسوف نبلغكم في حالة علمنا بأي تأخير غير متوقع
عند قيامك باختيار طلب من المحلات المتوفرة لديك، فأنت تستطيع تقديم طلبك بالضغط على زر "تنفيذ الطلب". يرجى الملاحظة أنه من المهم أن تقوم بمراجعة المعلومات التي تقوم بإدخالها وتصحيح أي أخطاء قبل الضغط على زر "تنفيذ الطلب" ، نظرا لأنه عند الضغط على هذا الادخال فسوف لا يمكن تصحيح الاخطاء. وعند استلامنا طلبك، سوف تبدأ تطبيق كاراميلا في تنفيذ الطلب وسوف نرسل رسالة في الصفحة النهائية تُفيد بأنه قد تم استلام طلبك وإرساله بنجاح الى المحل. وعندما تقوم بالدفع بطريقة غير مصرح بها، سوف يتم اعادتك الى الصفحة السابقة على التطبيق ولن نكون ملزمين بتقديم الخدمات

يحق لك إلغاء الطلب خلال (5) دقائق من تقديم الطلب على تطبيقنا على الشبكة
بالرغم من بذل كل جهد لضمان الحفاظ على الأسعار والأوصاف الصحيحة، إلا أننا نحتفظ بحق إلغاء أي طلب يحتوي على معلومات غير صحيحة
يجوز إلغاء الطلب بعد ذلك بواسطة المحل بعد استلامك رسالة التأكيد بإرساله الى المحل. وتحتفظ تطبيق كاراميلا والمحلات المشتركة معها بحق إلغاء أي طلب قبل أو بعد القبول، وسوف نقوم بإبلاغك فوراً بأي إلغاء مذكور


أي عضو في تطبيق كاراميلا يحصل على "اسم مستخدم" و"كلمة سر" يتم تحديدها بواسطة العضو نفسه. إن "اسم المستخدم" شخصي ويقتصر على العضو وحده، ونفس "اسم المستخدم" لا يتم منحه إلى عضوين مختلفين. كما أن "كلمة السر" تكون معلومة للمستخدم وحده. ويمكن للمستخدم تغيير كلمة السر في أي وقت. كما أنه من مسؤولية المستخدم وحده اختيار وحماية كلمة السر. إن تطبيق كاراميلا غير مسؤولة عن أي مشاكل قد تنشأ عن استخدام كلمة السر. وتقوم تطبيق كاراميلا بإبلاغ المستخدم عن العروض التي تتم في منطقته والتي يمكن للمستخدم الاستفادة منها عن طريق الرسائل الالكترونية. إن تطبيق كاراميلا لا تشارك معلومات المستخدم مع الغير من الشركات، وقد يتم مشاركة رقم الهاتف مع المحل الذي يتعامل مع الطلبات الخارجية ، لكي يتم تقديم خدمة توصيل سريعة وصحيحة. ولكي يقوم المستخدم بالاستفادة من خدمات تطبيق كاراميلا التي تتطلب عضوية في تطبيق كاراميلا، يتعين على المستخدم إدخال اسم المستخدم وكلمة السر. ويطلق على هذه العملية "تسجيل الدخول" الى تطبيق كاراميلا

عند استخدام التطبيق، فأنت تضمن أن أية معلومات شخصية مقدمة منك صحيحة ودقيقة وسارية المفعول وكاملة من كافة النواحي وانك سوف تقوم بإبلاغنا فورا بأي تغييرات على معلوماتك الشخصية عن طريق تحديث معلومات العضوية الخاصة بك على التطبيق أو عن طريق الاتصال بنا. وتوافق على عدم تقمص شخصية أي شخص او جهة اخرى او استخدام اسم مزور او اسم لا تكون مصرح باستخدامه
لا يسمح لك بتسجيل عضويات متعددة للاستخدام بواسطة نفس الشخص. وقد ينتج عن انتهاك هذا البند انهاء عضويتك
يجب الاحتفاظ بكلمات السر الخاصة بالاعضاء في سرية تامة في كافة الاوقات ولا يجب مشاركتها أو الكشف عنها إلى أي شخص آخر. انت مسؤول عن كافة الانشطة والطلبات التي تحدث او التي يتم تقديمها عن طريق عضويتك. واذا اصبحت على علم او اشتبهت في ان هناك شخص يعلم كلمة السر الخاصة بك، عندئذ يتعين عليك الاتصال بنا فورا.
لا يجوز لك استخدام التطبيق لأي غرض غير مشروع أو غير مصرح به، بما في ذلك وبدون حصر:
توزيع أي مواد غير قانونية، تشهيرية، مسيئة، تهديدية، ضارة، خليعة أو مواد معترضة للتطبيق

ارسال مواد تشكل مخالفة للقانون أو الأديان أو العقائد والمذاهب أو الأخلاق، وينتج عنها مسؤولية مدنية او خلاف ذلك تنتهك أي قوانين ولوائح أو أنظمة أو ممارسات
التدخل باستخدام او استمتاع أي شخص بالتطبيق
التسبب في الإضرار بالتطبيق أو اعاقة أو التقليل من تشغيل هذا التطبيق أو محاولة الحصول على حرية ولوج غير مصرح به إلى هذا التطبيق أو الى الشبكات الموصلة به، عن طريق القرصنة أو الخداع او أي وسائل اخرى مشابهة
نتوقع أن يحمل كل جهاز حساب عميل واحد فقط. في مثل هذه الحالات، قد يُسمح للعميل باستخدام الخدمة ولكنه لن يتمكن من الاستمتاع بالعروض الترويجية.

خلال استخدام خدمات تطبيق كاراميلا، يقبل العضو ويقر بما يلي :
ان المعلومات الواردة في استمارة التسجيل صحيحة، بشرط ان تكون هذه المعلومات مطلوبة، وأن العضو هو المسؤول وحده عن أية خسائر قد تنشأ عن أية معلومات خاطئة او معلومات غير كافية (على سبيل المثال نسيان كلمة السر) وفي تلك الحالات يتم انهاء عضويته.
ان العضو هو وحده المسؤول عن كافة الافكار والاراء والبيانات الشخصية التي يذكرها اثناء استخدامه خدمات تطبيق كاراميلا، وكذلك مسؤولا عن كافة الملفات التي يتم تحميلها الى تطبيق كاراميلا والمعلومات الشخصية المرسلة، وإن تطبيق كاراميلا لن تكون مسؤولة بأي شكل من الأشكال عن تلك الملفات، أو عن الولوج الى أي خدمات مقدمة عبر تطبيق كاراميلا يكون غير مصرح بها أو بأي طريقة أخرى غير تلك المحددة بواسطة تطبيق كاراميلا ، وعدم تغيير البرمجيات باي طريقة، وتعويض تطبيق كاراميلا عن كافة الخسائر المادية والادبية في حالة عدم التزام العضو بالمواد المذكورة اعلاه. ولن تكون تطبيق كاراميلا مسؤولة عن أي اضرار قد تنشأ عن قراءة البيانات العائدة الى أي أعضاء بواسطة أي افراد غير مصرح لهم. ويجب على العضو عدم ارسال أي رسائل تكون تهديدية، أو غير أخلاقية، أو عنصرية أومناقضة لقوانين الاردن والاتفاقيات الدولية. وأي مراسلات أو عناوين أو اسماء مستعارة يجب ألا تكون مخالفة للوائح والآداب العامة والسلوك الحسن والقوانين. ويلتزم بعدم مضايقة و/أو تهديد المستخدمين الآخرين، أو أي من موظفي خدمة العملاء التابعين لـتطبيق كاراميلا ، وعدم التصرف بطريقة تؤثر على استخدام الخدمات من قبل المستخدمين الاخرين، وعدم ارسال، طباعة، أو توزيع أو تعميم أية مواد لا أخلاقية، غير مناسبة وغير قانونية أومعلومات قد تسبب ضررا بأسماء أي أشخاص أو مؤسسات، أو الاعلان، أو البيع أو العرض لبيع أي منتجات أو خدمات، أو المشاركة في أي أفعال ضارة مثل المسح، أو المنافسة أو الرسائل المتسلسلة، وعدم ارسال أي معلومات أو برامج قد تؤدي الى الضرر بالمعلومات أو البرمجيات على أجهزة المستخدمين الآخرين. وكافة السجلات أو المواد التي يتم الحصول عليها بواسطة استخدام خدمات تطبيق كاراميلا تكون ضمن موافقة المستخدم، وسوف يكون المستخدم مسؤولا تماماً عن أي اضرار أو فقد المعلومات أو أي خسائر اخرى ناتجة عن ذلك لجهاز كمبيوتر المستخدم، ولا يحق للمستخدم المطالبة بالتعويض عن أي خسائر تنشأ عن استخدام الخدمة، كما يلتزم بعدم استخدام خدمات تطبيق كاراميلا لاي اغرض تجارية أواعلانية بدون الحصول على موافقة تطبيق كاراميلا.
ا. قد تقوم تطبيق كاراميلا بمراقبة كافة الانظمة في أي وقت او باستمرار
ب. قد تقوم تطبيق كاراميلا باستخدام نظامها لاغراض تجارية.
عدم ارسال أي معلومات بالبريد الإلكتروني تكون محظورة قانونيا أوتوزيع أي رسائل غير معتمد ارسالها مثل رسائل البريد المتسلسلة والبرامج الضارة الخ، وعدم تسجيل واساءة استخدام أي معلومات شخصية عائدة الى الاخرين. ان العضو نفسه مسؤول عن كافة انواع التصرفات التي يتم القيام بها تحت اسم "المستخدم". ويتعين على الاعضاء دفع رسوم الخدمة التي تم طلبها مسبقا عند تسليم المنتجات، وخلاف ذلك لن يتم تسليم المنتجات الى العملاء، وعدم الولوج الى التطبيق او الخدمات باستخدام حساب/تسجيل طرف ثالث بدون موافقة صريحة من حامل الحساب، وعدم استخدام التطبيق لاغراض غير قانونية، وعدم ارتكاب أي تصرفات مخالفة على التطبيق او فيما يخص المحتوى على التطبيق، وعدم استخدام التطبيق للقيام بأي انشطة تجارية غير الاستخدام المصرح له لخدمات تطبيق كاراميلا ، وعدم نسخ أي محتوى، بما في ذلك وبدون حصر محتوى قوائم المحلات ومراجعات الغير، لاعادة النشر بشكل مطبوع او عبر الانترنت، وعدم انشاء مراجعات المحل او تسجيل أي ادخالات لصالح او مع أي غرض تجاري او غرض اخر او قصد لا يتفق بنية حسنة مع غرض إنشاء التطبيق، وعدم محاولة الحصول على حرية دخول غير مصرح بها الى انظمة كمبيوتر الاخرين من او عن طريق التطبيق وعدم التدخل في استخدام شخص آخر أو جهات أخرى للتطبيق ، وعدم تحميل او نقل الفيروسات او الملفات الضارة والتخريبية او التدميرية الاخرى، و/او
عدم تعطيل، التدخل في او حتى التسبب في ضرر أو مخالفة أمن التطبيق، او أي خدمات، البرمجيات او الأجهزة المرتبطة بالنظام، الحسابات، كلمات السر، الخوادم او الشبكات المرتبطة بالتطبيق أو التي يتم الدخول إليها عن طريق المواقع أو المواقع الزميلة أو الموصلة (بما في ذلك تلك العائدة الى شركائنا من المحلات).
يتعين على كافة المستخدمين من القصر في المكان الذي يقيمون فيه (عموما تحت 18 سنة) الحصول على تصريح من ولي أمرهم، ويتم الاشراف عليهم مباشرة بواسطة ولي امرهم او الاب /الام عند استخدام التطبيق. اذا كنت قاصر، يتعين على ولي امرك/ والدك قراءة هذه الاتفاقية والموافقة عليها قبل قيامك باستخدام التطبيق على الشبكة.
بطاقات الإئتمان أو الدفع المسبق التي يستخدمها العميل في السداد من خلال بوابة الدفع الإلكتروني على تطبيق كاراميلا يتوجب أن تعود ملكيتها للعميل نفسه. في حال كانت ملكية البطاقة تعود لشخص آخر فيتوجب على العميل إستخدامها بصورة قانونية وذلك بموافقة صاحب البطاقة.


خلاف المعلومات الشخصية، التي تم تغطيتها في سياسة الخصوصية لـ تطبيق كاراميلا ، فإن أي مواد تقوم بارسالها او نشرها على هذا التطبيق على الشبكة سوف تعتبر غير سرية وغير شخصية. ولن يكون على تطبيق كاراميلا أي التزامات فيما يخص هذه المواد. وسوف يكون لـتطبيق كاراميلا واي شخص نقوم بتعيينه الحرية لنسخ وتصحيح وتوزيع وتضمين أو أي استخدام خلاف ذلك لهذه المواد وكافة البيانات والصور والاصوات والنصوص والاشياء الاخرى المشمولة فيه لأي ولكافة الاغراض التجارية او غير التجارية.
يحظر عليك نشر وتحميل أو ارسال إلى أو من التطبيق على الشبكة أي من المواد التالية:
تنتهك أي قانون محلي، وطني او دولي معمول به.
غير مشروعة او احتيالية.
تصل الى حد الاعلان غير المصرح به او تحتوي على فيروسات او أي برامج اخرى ضارة.
لا يجوز لك اساءة استخدام التطبيق (بما في ذلك بواسطة القرصنة)
أي تعليقات أو ملاحظات يضعها المستخدم على التطبيق يجب ألا:
تحتوي على أي مواد تشهيرية، خليعة او مخالفة.
تعزز العنف او التمييز.
تنتهك حقوق الملكية الفكرية لشخص اخر.
تنتهك أي واجب قانوني تجاه طرف ثالث (مثل واجب السرية).
تعزز النشاط غير القانوني او تخترق خصوصية الاخر.
تقدم انطباعا انها صادرة عنا اويتم استخدامها لتقمص شخصية شخص اخر او تقديم معلومات خاطئة عن ارتباطك بشخص اخر.
إن التصرفات المحظورة الواردة في الفقرات اعلاه غير حصرية. وسوف تقوم بتعويض تطبيق كاراميلا عن كافة النفقات والاضرار التي تتحملها كنتيجة لانتهاكك لأي من تلك القيود.
سوف تقوم تطبيق كاراميلا بالتعاون بالكامل مع أي جهات تنفذ القانون او قرارات المحكمة التي تطلب منا او توجهنا للتصريح عن هوية أو تطبيق أي شخص يقوم بنشر أي مواد بمخالفة الفقرات المذكورة أعلاه 

ا يجوز لك الدخول الى او استخدام التطبيق لاي غرض اخر بخلاف ذلك الذي تقوم تطبيق كاراميلا بتوفيره. ان التطبيق هو للاستخدام الشخصي للمستخدمين فقط ولا يجوز استخدامه بالارتباط مع أي مصالح تجارية باستثناء تلك التي تم اقرارها او اعتمادها تحديدا من تطبيق كاراميلا. في حال إرتكاب المستخدم أي أنشطة محظورة، فإن الـ لديها الحق في تعليق، أو منع أو إنهاء عضوية المستخدم ومنع دخوله إلى الخدمة. تتضمن الانشطة المحظورة ولا تقتصر على ما يلي:
النشاط الجنائي او التقصيري، بما في ذلك الافلام الخلاعية للاطفال، الاحتيال، التجارة في المواد الخليعة، الاتجار في المخدرات، القمار، التحرش، المطاردة، البريد الالكتروني غير المرغوب فيه، انتهاك حقوق النشر، انتهاك براءات الاختراع او سرقة الاسرار المهنية.
‌الاعلان او استدراج أي شخص لشراء او بيع أي منتجات او خدمات، ما لم يكن ذلك مصرح من تطبيق كاراميلا.
‌الاستعادة النظامية للبيانات او المحتويات الاخرى من التطبيق على الشبكة لانشاء او تأليف، بشكل مباشر أو غير مباشر، مجموعة، مؤلف ، قاعدة بيانات، او دليل بدون أي تصريح خطي من تطبيق كاراميلا.
‌القيام بأي استخدام غير مصرح به لخدمات تطبيق كاراميلا ، بما في ذلك جمع اسماء المستخدمين و/أو عناوين البريد الالكتروني للمستخدمين بواسطة وسائل الكترونية او اخرى لغرض ارسال بريد الكتروني غير مرغوب فيه.
‌‌المشاركة في أي صياغة غير مصرح بها او ربطها بالتطبيق.
‌ارسال رسائل متسلسلة او بريد الكتروني غير مرغوب فيه الى المستخدمين الآخرين.
‌استخدام أي معلومات يتم الحصول عليها من التطبيق على الشبكة لكي يتم الاتصال، الاعلان عن، او استدراج او البيع الى أي مستخدم بدون موافقته الصريحة المسبقة.
‌المشاركة في أي استخدام اتوماتيكي للنظام مثل ارسال النصوص لاضافة الاصدقاء او ارسال الملاحظات او الرسائل او استخدام أي ادوات استخراج بيانات او ادوات جمع واستخراج بيانات اخرى.
‌التدخل في، تعطيل او انشاء عبء غير مبرر على التطبيق او الشبكات او الخدمات المرتبطة بالتطبيق.
‌‌محاولة تقمص شخص او مستخدم اخر.
‌‌استخدام اسم المستخدم العائد الى شخص اخر.
‌‌بيع او بخلاف ذلك تحويل البيانات الخاصة بك.
‌استخدام أي معلومات تم الحصول عليها من التطبيق لكي يتم مضايقة، الاساءة الى او الضرر بشخص اخر.
‌استخدام خدمة تطبيق كاراميلا كجزء من أي جهد لمنافسة تطبيق كاراميلا او تقديم الخدمات كمكتب خدمة.
‌فك شفرة، فك تأليف، تفكيك او عكس هندسة أي من البرمجيات التي يتكون منها التطبيق أو تشكل جزءا من التطبيق.
‌محاولة تجاوز أي اجراءات للتطبيق مصممة لمنع او تقييد الدخول الى التطبيق او أي جزء من التطبيق.
مضايقة، ازعاج، ترهيب او تهديد لـ تطبيق كاراميلا من خلال أي وسيلة إتصال أو لأي موظفي او وكلاء تابعين لـ تطبيق كاراميلا أو من يشاركون في تقديم أي جزء من خدمات تطبيق كاراميلا.
‌عرض اعلان او قبول مدفوعات او أي شيء ذي قيمة من الغير مقابل قيامك بأداء أي نشاط تجاري على او عن طريق التطبيق نيابة عن ذلك الشخص، مثل نشر البلوجات أو النشرات ذات الغرض التجاري.
‌حذف حقوق النشر او اشعار حقوق الملكية الاخرى من أي مساهمة او محتوى على تطبيق كاراميلا.
‌‌استخدام التطبيق باي اسلوب لا يتفق مع أي وكافة القوانين واللوائح المعمول بها.
أي إشتباه بالقيام بعمليات غير مشروعة على تطبيق وتطبيقات تطبيق كاراميلا

يجوز ان تقوم تطبيق كاراميلا بشكل مؤقت بتوقيف او التوقف تماما عن تشغيل النظام في أي وقت.
لن يكون على تطبيق كاراميلا أية مسؤوليات تجاه اعضاء تطبيق كاراميلا او أي طرف ثالث بسبب التوقيف المؤقت او التوقف الكامل لتشغيل النظام.
سوف يتم عرض اسم المستخدم وكلمة السر واعتماده بعد تعبئة بيانات النموذج الذي سيتم تقديمه الى العملاء بواسطة تطبيق كاراميلا . ويجوز ان تقوم تطبيق كاراميلا بمنع عملائها الذين قاموا بتعبئة بيانات النموذج أو تواصلوا مع التطبيق، بالرغم من ان لديهم كلمات سر من الحصول على كلمة سر جديدة او من استخدام كلمات السر الخاصة بهم لمدة زمنية غير محددة؛ اذا اعتبرت تطبيق كاراميلا ذلك ضروري.
لا تضمن تطبيق كاراميلا أن خدماتها سوف يتم تقديها في الوقت المحدد بطريقة آمنة وتامة، وان النتائج التي سيتم الحصول عليها من الخدمات سوف تكون صحيحة وموثوق فيها، وان نوعية الخدمات سوف ترقى إلى مستوى التوقعات، حيث ان دور تطبيق كاراميلا ينحصر في إخطار المحل بطلبات العميل.
يحق لـتطبيق كاراميلا ان تقوم بدعم وحذف كافة او بعض الملفات والرسائل التي يتم تقديمها بواسطة الاعضاء أثناء استخدام الخدمات لبعض الوقت وذلك خلال الفترات التي تعتبر مناسبة بواسطة تطبيق كاراميلا . ولن تكون تطبيق كاراميلا مسؤولة عن اجراءات الدعم والحذف.
إن تطبيق كاراميلا لديها حقوق الملكية والنشر الناشئة عن ملكية المعلومات والمستندات والبرمجيات والتصميمات والرسوم البيانية الخ، التي تقوم بانتاجها بنفسها و/او يتم شراءها من الخارج.
وتطبيق كاراميلا ليست مسؤولة عن أي بضاعة يتم طلبها ولم يتم توصيلها من قبل المحل بسبب عدم توفرها
يحق لـتطبيق كاراميلا نشر أي معلومات ومستندات وبرمجيات وتصميمات ورسوم بيانية الخ (مثل الرسائل والاشعار والتقارير/الاخبار والملفات المرسلة الى النشرات) التي يتم انتاجها بواسطة الاعضاء وتحميلها الى النظام بواسطة الاعضاء و/أو يتم ارسالها الى مكان اخر ضمن التطبيق يعتبر ملائم بواسطة تطبيق كاراميلا ومن المحتمل ان يتم نسخ و/او نشر هذه المعلومات بواسطة المستخدمين الاخرين. وفي تلك الاحوال، لن يطلب المستخدمين أي اتعاب من تطبيق كاراميلا.
ان الالتزام بتغيير المعلومات المتعلقة بالسعر ومواصفات المنتج التي يتم تقديمها للبيع عبر تطبيق كاراميلا يعود الى الشركات التي يكون لديها محلات مشتركة مع تطبيق كاراميلا. وفي حالة أية معلومات خاطئة تتعلق بالسعر ومواصفات المنتج، يجوز ان تقوم تطبيق كاراميلا بتصحيح الخطأ عن طريق الغاء الطلب.
يجوز ان تقوم تطبيق كاراميلا بارسال العضو الى تطبيق اخر على الشبكة. وفي هذه الحالة، يوافق العضو على ان تطبيق كاراميلا لن تكون مسؤولة عن سياق محتوى التطبيق الذي يجوز للعضو الولوج اليه.
يجوز ان تقوم تطبيق كاراميلا باي تغييرات على تنفيذ هذه الاتفاقية وتعديل المواد القائمة او اضافة مواد جديدة لغرض الالتزام بأي التزامات فنية وتشريعات يتم اصدراها في المستقبل.
يجوز ان تقوم تطبيق كاراميلا بتغيير الخدمات التي لا تتطلب عضوية الى شكل يتطلب عضوية. ويجوز ان تقوم تطبيق كاراميلا بتقديم خدمات اضافية وتغيير بعض الخدمات جزئيا او بالكامل او تحويلها الى خدمة مدفوعة.
يجوز ان يكون هذا التطبيق غير متاح في بعض الاوقات للسماح بعمليات الصيانة والتحديث. وبالرغم من اننا سوف نسعى لابلاغ العملاء مسبقا بعدم توفر أي خدمة مذكورة، الا ان ذلك لا يمكن ضمانه ونحتفظ بحق تعديل او سحب الخدمة في أي وقت.

تتم الموافقة على التعليقات المرسلة من المستخدمين وفق المعايير التالية:
العلاقة المباشرة:
يجب أن يكون الشخص صاحب التعليق قد اختبر الخدمة مباشرة من خلال المحل.
المحتوى المقبول للتعليق:
تطبيق كاراميلا غير ملزمة بقبول أي من التعليقات التي يتم ارسالها عن طريق المستخدمين، ومن بعض الأسباب التي يمكن ان نرفض نشر التعليقات بسببها هي كالآتي:
التعليقات التي تحتوي على لهجة هجومية، إباحية ، اسائية ، عنصرية ، لغة الكراهية ، كلها أمـور لا يمكننا نشرها على تطبيقنا.
تعليقات ليس لها علاقة بموضوع تقييم المحل.
التعليقات التي تتضمن التمـييز القائم على الـدين، العـرق، الجنس، العمر، الحالة الزوجية أو الإعـاقة الجسدية او الفكرية.
أي محتوى له دلالات أو اشارات تخالف تقاليد المجتمع، أو تدعو الى توجه غير قانوني.
تضارب المصالح : حيث لا يُسـمح للمحلات المنافسة وضع أي تعليقات سلبية. (أي مخالفات بهذا الصدد، ممكن أن تؤدي إلى إزالة دائمة لتلك المحلات من تطبيقنا).
الادعاءات المتعلقة بمخالفة قوانين الصحة.
التعليقات التي تعكس معلومات قديمة وغير نافذة.
أصحاب التعليقات لا يمثلون رأي تطبيق كاراميلا على الإطلاق ولا الشركة المالكة الرئيسية، ولا أي من الشركات التابعة. لتطبيق كاراميلا غير مسـؤول عن أي إلتزامات أو مطالبات أو خسائر ناتجة عن أي من التعليقات المنشورة أو أي من المحتوى الموجود على التطبيق.

ملكية تطبيق كاراميلا:
التعليقات المنشورة على التطبيق هي ملك لتطبيق كاراميلا وملكيتها حصرية إلى الأبد. لدينا الحق في إعادة إنتاج وتعديل وترجمة ونقل و/أو توزيع جميع المواد المتعلقة بالتعليقات. تطبيق كاراميلا ليست ملزمة بأي شكل من الأشكال بالدفع لأصحاب التعليقات أو لأي شخص أو جهة اخــرى مقابل تعليقاتهم.
يجوز ان تقوم تطبيق كاراميلا بإنهاء هذه الاتفاقية من جانب واحد في أي وقت.

توافق على ان عواقب الاستخدام التجاري او اعادة نشر محتوى او المعلومات من التطبيق بدون تصريح من الشركة قد تكون جسيمة ولا يمكن تقديرها بحيث لا يكون التعويض النقدي كافي او ملائم وإن تطبيق كاراميلا سوف يحق لها اتخاذ قرار مؤقت ودائم لحظر هذا الاستخدام.
اثناء أي عملية توصيل للمنتج يتم القيام بها بواسطة المحلات، وفي حالة عدم تواجد العميل في العنوان المحدد في النظام، لن يتم تسليم البضاعة التي طلبها العميل الى أي مكان اخر. وفي هذه الحالة، يتعين على العضو قبول كافة المسؤوليات القانونية الناشئة عن طلب غرض إلى عنوان لا يقيم فيه.

بالنسبة إلى اعادة المنتج، يتم تطبيق شروط اعادة المنتج الخاصة بالمحلات. إن تطبيق كاراميلا لا تتحمل أي مسؤوليات عن النزاعات التي قد تنشأ عن شروط اعادة المنتج الخاصة بالمحلات.

1.	يستطيع العميل النهائي الاختيار بين طرق الدفع المختلفة على لتطبيق كاراميلا، وهى في الوقت الحالي: نقداً 
2. يحق لتطبيق كاراميلا توفير اي طرق دفع اخرى غير متاحة حالياً، أو حجب اي طرق دفع متوفرة حاليا
3. في حال الدفع عن طريق الانترنت، يلتزم العميل النهائي باختيار احد طرق الدفع المتاحة عند الطلب، حيث سيتم التعامل مع عمليات الدفع عبر الانترنت من خلال مزودي خدمة الدفع عبر الانترنت
4. . فقط في حال وافق العميل مسبقاً على ذلك، سيقوم مزودوا خدمة الدفع عبر الانترنت بالاحتفاظ ببيانات بطاقة العميل لاستخدامها فى حال الطلب لاحقا دون الحاجة الى ادخال البيانات البطاقة الائتمان عند كل عملية دفع
5. . يلتزم العميل دوماً بضمان ان رصيد البطاقة كافٍ لدفع قيمة الطلب وذلك قبل القيام بالطلب، كما يلتزم العميل باستخدام البطاقة ضمن الحد الائتمانى المسموح للبطاقة. كما يلتزم العميل بعدم التورط بعمليات رد المبالغ المدفوعة الغير مصرح بها.

إن تطبيق كاراميلا تتعامل مع رضا العملاء بمنتهى الجدية. وفي حالة وجود مشاكل مع طلب أي غرض، يرجى الاتصال بـتطبيق كاراميلا عبرالهاتف لدينا أو بالاتصال بنا عبر الهاتف وسوف نقوم بمساعدتك ونحاول حل المشكلة، وفي الحالات التي تم فيها اصدار فاتورة لك عن طريق تطبيق كاراميلا ، سوف تقوم تطبيق كاراميلا برد كامل او جزء من المبلغ طبقا للحالات التالية: في حالة عدم حصولك على الطلب او استلام طلب غير صحيح، يجوز اصدار رد المبلغ كاملا لك، وفي حالة نقص جزء من طلبك، سوف نقوم باصدار رد جزء من المبلغ، وفي جميع الحالات، سوف نبذل قصارى جهدنا لضمان رضائك عن خدمة تطبيق كاراميلا.

عند قبول طلبك، فإن ذلك يمثل اتفاق بينك كعميل وبين المحل، وتقع على المحل وحده المسؤولية عن هذا الطلب. ويتم الدفع النقدي مباشرةً الى المحل الذي يقوم بتلبية الطلب. وفي حالة اختيارك للدفع عن طريق بطاقة ائتمان أو الدفع المسبق عبر التطبيق، عندئذ سيتم تنفيذ المعاملة من خلال تطبيق كاراميلا كوسيط بينك وبين المحل، وسوف يتم احتساب رسوم التوصيل أو أي رسوم اخرى لكل طلب وبناءا على سياسة كل محل وأي رسوم توصيل أو رسوم أخرى سوف يتم عرضها بوضوح في ملخص الطلب.
بطاقات الدفع المسبق / الائتمان:
يرجى قراءة الشروط والأحكام الخاصة بالخدمة قبل استخدام خدمة بطاقة الدفع المسبق / الائتمان:
إن العميل مسؤول عن الدفع إلى المحل، وقد يقوم المحل بفرض رسوم إضافية في حال أضاف العميل "طلب خاص" أو "طلب عام" إلى طلبه، وسوف يتم الدفع نقداً لهذه الطلبات الإضافية عند توصيل الطلب.
يحق للعميل إلغاء الطلب في حالة تجاوز زمن التوصيل أكثر من زمن التوصيل المحدد من قبل المحل ، وسوف يتم رد المبلغ الذي قام العميل بدفعه الى حساب العميل.
يحق للعميل إلغاء الطلب خلال 5 دقائق بحد اقصى من قبول الطلب.
قد تستغرق عملية استرداد المبلغ لحساب العميل عبر بوابة الدفع الخاصة ببطاقة الدفع المسبق / الائتمان مدة 2-7 أيام عمل، وفي حال أي تأخير في إعادة قيد المبلغ لحساب العميل الذي قام بدفعه، يتوجب على العميل المتابعة مع البنك مباشرة وسوف نرسل رسالة إلكترونية للعميل تحتوي على نسخة مطبوعة من إشعار رد المبلغ المطبوع وذلك من بوابة الدفع الخاصة ببطاقة الدفع المسبق / الائتمان كمرجع له في حالة ما إذا رغب العميل في مراجعة البنك .
إن العملاء المستخدمين لخدمة الدفع الخاصة ببطاقة الدفع المسبق / الائتمان مطالبين بالتواجد على أرقام الاتصال الخاصة بهم.
سوف يتم تعويض العميل من قبل المحل في حالة نقص أي جزء من الطلب (يسري التسديد فقط مقابل البند الناقص ويخضع التعويض للسياسة الخاصة بالمحل)
بطاقات الإئتمان أو الدفع المسبق التي يستخدمها العميل في السداد من خلال بوابة الدفع الإلكتروني على تطبيق أو تطبيقات تطبيق كاراميلا يتوجب أن تعود ملكيتها للعميل نفسه. في حال كانت ملكية البطاقة تعود لشخص آخر فيتوجب على العميل إستخدامها بصورة قانونية وذلك بموافقة صاحب البطاقة.
ان العميل مسؤول بالكامل عن تنفيذ وتقديم الطلب باستخدام خدمة الدفع الخاصة ببطاقة الدفع المسبق / الائتمان بعد القراءة الدقيقة لكافة الشروط والاحكام.

في حالة النزاعات التي قد تنشا بالارتباط مع هذه الاتفاقية، يوافق العضو ويقر ان ادخال أي قيود وميكروفيلم وميكروفيش وسجلات كمبيوتر تشكل دليل ساري المفعول ونافذ ومطلق وشامل، ان هذه المادة لها خصائص عقد الاثبات وان العضو يتنازل مسبقا عن كافة انواع الاعتراضات على سجلات تطبيق كاراميلا بالارتباط مع حقيقة ان هذه السجلات يتم الاحتفاظ بها بالشكل الواجب وفقاً للقانون.

تخضع شروط هذا التطبيق وتفسر وفقا للقانون. وسوف تخضع النزاعات الناشئة والمتعلقة بشروط التطبيق الماثلة (بما في ذلك النزاعات غير التعاقدية) الى الاختصاص الحصري للمحاكم.

ي حالة اعتبار أي جزء من شروط الاستخدام الماثلة غير قانونية او باطلة او غير قابلة للتنفيذ لاي سبب، عندئذ سوف يعتبر هذا الحكم قابل للفصل عن شروط الاستخدام الماثلة ولن تؤثر على صلاحية وقابلية تنفيذ أي من الاحكام المتبقية لشروط الاستخدام الماثلة. ولن يتم تفسير أي تنازل من جانبنا كتنازل عن أي انتهاك سابق او لاحق لاي حكم.

تمنح تطبيق كاراميلا لك التصريح (الذي يجوز الغاؤه في أي وقت لاي سبب وبدون سبب) لمشاهدة التطبيق وللتحميل والتراسل الالكتروني والمشاركة عبر الشبكات الاجتماعية او طباعة الصفحات الفردية من التطبيق وفقا لشروط الاستخدام الماثلة وفقط لاستخدامك الشخصي غير التجاري، شريطة عدم قيامك بإزالة أي علامة تجارية، اشعار حقوق نشر او اشعار اخر مشمول في هذه الصفحات. ولا يسمح بأي استخدام اخر. ولا يجوز ان تقوم، على سبيل المثال، بتضمين المعلومات والمحتوى او المواد الاخرى في أي قاعدة بيانات، مؤلف، ارشيف او ذاكرة مؤقتة. ولا يجوز ان تقوم بتعديل، نسخ، توزيع، اعادة نشر، ارسال، عرض، اداء، اعادة انتاج، نشر، اعادة استخدام، اعادة بيع، ترخيص، انشاء اعمال مشتقة من، تحويل او بيع أي معلومات، محتوى، مواد، برمجيات، منتجات او خدمات يتم الحصول عليها من التطبيق، باستثناء ما هو مذكور تحديدا اعلاه. وباستثناء ما هو مصرح تحديدا من تطبيق كاراميلا ، لا يجوز ان تقوم بالربط بالتطبيق لاي غرض او الولوج الى التطبيق يدويا او عن طريق أي robot, spider, web crawler, extraction software او أي عملية اتوماتيكية او أداة لغرض كشط، نسخ او مراقبة أي جزء من التطبيق او أي معلومات، محتوى، او مواد على المواقع. وتحتفظ تطبيق كاراميلا بكافة حقوقها بموجب التشريع والقانون العام ضد أي شخص او جهة تنتهك هذه الفقرة. ولا يجوز ان تقوم بالربط او الوصل بأي صفحات بالتطبيق أو أي محتوى مشمول فيها، سواء بالكامل او جزئيا، بدون الموافقة الخطية المسبقة من تطبيق كاراميلا. وقد تشارك الوصلات مع التطبيق عن طريق عن طريق المواقع الإجتماعية الموجودة على التطبيق . وإن أي حقوق اخرى لم يتم منحها صراحة في هذه الشروط محتفظ بها.

ان المحتوى على تطبيق الشبكة (محتوى تطبيق كاراميلا) والعلامات التجارية وعلامات الخدمة والشعارات المشمولة في هذه الشروط (العلامات) مملوكة لدى تطبيق كاراميلا او تم ترخيصها الى تطبيق كاراميلا وتخضع الى حقوق النشر وحقوق الملكية الفكرية الاخرى في دولة الكويت والمعاهدات الدولية. ان محتوى تطبيق كاراميلا يتضمن بدون حصر كافة محتوى البرمجيات الأساسي وقواعد البيانات والوظائف والبرمجيات وتصميمات التطبيق على الشبكة والصوت والفيديو والنص والصور الفوتوغرافية والرسوم البيانية. ان كافة الرسوم البيانية والشعارات والتصميمات ورؤوس الصفحات والأيقونات والنصوص واسماء الخدمة العائدة الى تطبيق كاراميلا هي علامات تجارية مسجلة وعلامات تجارية بموجب القانون العام او شكل تجاري لـتطبيق كاراميلا في الكويت و/أو بلدان اخرى. ولا يجوز استخدام العلامات التجارية والشكل التجاري العائد الى تطبيق كاراميلا بما في ذلك كجزء من العلامات التجارية و/أو كجزء من اسماء النطاق، بالارتباط مع أي منتج او خدمة بأي اسلوب من المحتمل ان يسبب ارتباك ولا يجوز نسخها، تقليدها، او استخدامها سواء بالكامل او جزئيا بدون تصريح خطي مسبق من تطبيق كاراميلا. ان محتوى تطبيق كاراميلا على تطبيق الشبكة يتم تقديمه إليك "كما هو" لمعلوماتك واستخدامك الشخصي فقط ولا يجوز استخدامه، نسخه، اعادة انتاجه، توزيعه، نقله، بثه، عرضه، بيعه، ترخيصه او بخلاف ذلك استغلاله لاي أغراض اخرى ايا كانت، بدون التصريح الخطي المسبق من المالكين المعنيين. ان الاستعادة النظامية للبيانات أو أي محتوى آخر من التطبيق او لانشاء او تأليف، سواء بشكل مباشر او غير مباشر، مجموعة، مؤلف، قاعدة بيانات او دليل بدون التصريح الخطي من تطبيق كاراميلا محظور.
وبما انك مؤهل لاستخدام التطبيق ، يتم منحك ترخيص محدود للولوج الى واستخدام التطبيق على الشبكة ومحتوى تطبيق كاراميلا وتنزيل او طباعة نسخة عن أي جزء من محتوى تطبيق كاراميلا الذي حصلت على حرية الدخول اليه بشكل صحيح فقط للاستخدام الشخصي غير التجاري. وتحتفظ تطبيق كاراميلا بكافة الحقوق التي لم يتم منحها صراحة اليك في وعلى تطبيق الشبكة ومحتوى وعلامات تطبيق كاراميلا. وفي حالة قيامك بتنزيل او طباعة نسخة عن محتوى تطبيق كاراميلا للاستخدام الشخصي، يتعين عليك الاحتفاظ بكافة اشعارات حقوق النشر واشعارات الملكية الاخرى المشمولة فيها. وتوافق على عدم تجاوز وتبطيل او بخلاف ذلك التدخل في الخصائص الامنية الخاصة بتطبيق الشبكة او الخصائص التي تمنع او تقيد استخدام او نسخ أي من محتوى تطبيق كاراميلا او تنفيذ القيود على استخدام التطبيق على الشبكة او محتوى تطبيق كاراميلا.

عن طريق نشر أي مساهمات في أي جزء من التطبيق على الشبكة، فإنك تلقائيا تتعهد وتضمن ان لديك الحق لمنح تطبيق كاراميلا ترخيص غير قابل للنقض ودائم وغير حصري وقابل للتحويل وخالي من الاتعاب ومدفوع بالكامل في جميع انحاء العالم لاستخدام ونسخ وتقديم الأداء والعرض العام واعادة صياغة وترجمة واقتباس (بالكامل او جزئيا) وتوزيع هذه المساهمات لاي غرض، كالإعلان التجاري أو خلاف ذلك او بالارتباط مع التطبيق على الشبكة او ترويجها، لاعداد الاعمال المشتقة عن هذه المساهمات او تضمينها في اعمال اخرى، ومنح واعتماد اصدار التراخيص الفرعية للمذكور اعلاه.

يحق لـتطبيق كاراميلا – وفقا لتقديرنا وسلطتنا المطلقة– ان (1) تقوم بتحرير وصياغة أي من المساهمات او بخلاف ذلك تغييرها (2) اعادة تصنيف أي مساهمات لوضعها في مواقع ملائمة بقدر اكبر او (3) الفرز المسبق او حذف أي مساهمات التي يتقرر انها غير ملائمة او تنتهك هذه الاتفاقية.

كخدمة إضافية، قد يقدم التطبيق روابط مع مواقع اخرى على الشبكة. وبعض من هذه المواقع على الشبكة قد تكون تابعة لتطبيق كاراميلا بينما لا يكون البعض الاخر كذلك. ان تطبيق كاراميلا غير مسؤولة عن محتويات أي صفحات تطبيق على الشبكة تم انشاؤها والحفاظ عليها بمعرفة مؤسسات مستقلة عن تطبيق كاراميلا. ان زيارة أي صفحات مواقع اطراف ثالثة يكون على مسؤوليتك الخاصة. وليس لـتطبيق كاراميلا أي سيطرة على صفحات مواقع الشبكة الاخرى المذكورة، ولا يمكنها ان تضمن دقة وكمالية او توقيت المعلومات الواردة في صفحات مواقع الغير. ان استخدامك لهذه المعلومات طوعي واعتمادك على هذه المعلومات يجب ان يتم فقط بعد المراجعة المستقلة. ان الاشارات الى المنتجات التجارية او الخدمات ضمن أي صفحات مواقع الغير المذكورة لا يشكل او يعني موافقة تطبيق كاراميلا. وعن طريق استخدام التطبيق، تقر ان تطبيق كاراميلا ليست مسؤولة عن توفر المواقع الأخرى او المحتوى الكائن في او عبر أي صفحات المواقع الأخرى.

للحد المسموح به بموجب القانون، تقدم تطبيق كاراميلا هذا المحتوى والتطبيق على اساس "كما هو" و"كما هو متاح" ولا نقدم أي تعهد او ضمان من أي نوع، صريح كان ام ضمني، بخصوص محتوى او توفر هذا التطبيق، او انه سوف يكون في الوقت المحدد او خالي من الاخطاء، وأن العيوب سيتم تصحيحها، او ان التطبيق او الخادم الذي يقوم بتوفيره خالي من الفيروسات او المكونات الضارة الاخرى.
وبالخضوع الى الفقرة السابقة، فإن تطبيق كاراميلا أو مدراء ومسؤولي ووكلاء وموظفي او مقاولي تطبيق كاراميلا ليس عليهم أي مسؤولية تجاه أي خسائر او اضرار مباشرة أو غير مباشرة، خاصة او استتباعية (بما في ذلك وبدون حصر الاضرار عن خسارة العمل او خسارة الارباح)، التي تنشأ عن العقد، أو أي تقصير او خلاف ذلك من استخدام او عدم القدرة على استخدام هذا التطبيق. ولن يستثنى أي شيء من هذه الشروط او يقيد المسؤولية عن الوفاة او الاصابة الشخصية الناتجة عن اهمالنا او مسؤولية وكلائنا او موظفينا.

ت توافق على تعويض وتجنيب تطبيق كاراميلا وشركتها الام وشركاتها التابعة والزميلة ووكلائها ومسؤوليها ومدرائها او الموظفين من أي مطالبة، طلب، ضرر (سواء كان مباشر او غير مباشر او استتباعي) بما في ذلك اتعاب المحامي التي يتم تقديمها بواسطة أي شخص مرتبط باستخدامك للتطبيق، مع تقديماتك، مع أي انتهاك مزعوم به لحقوق الملكية الفكرية او أي حقوق اخرى لاي شخص او جهة اخرى ترتبط بالتطبيق، ومخالفتك لشروط الاستخدام الماثلة واي تصرفات اخرى او اغفالات تتعلق بالتطبيق.

ان المعلومات والمحتوى والمنتجات والخدمات والمواد المتوفرة من خلال المواقع (سواء تم تقديمها بمعرفة تطبيق كاراميلا ، من خلالك، من خلال المستخدمين الاخرين او اطراف زميلة اخرى/اطراف ثالثة) بما في ذلك وبدون حصر الطلبات، التقديمات، النص، الصور الفوتوغرافية، الرسوم البيانية، الملفات الصوتية، الفيديو والروابط، مقدمة "كما هي" وكما هي متاحة بدون ضمانات من أي نوع، صريحة كانت ام ضمنية لاقصى حد مسموح به بموجب القانون. ان تطبيق كاراميلا تتخلى عن كافة التعهدات والضمانات، صريحة كانت ام ضمنية، بما في ذلك ولا يقتصر على ضمانات قابلية التسويق، الملائمة لغرض معين، الملكية، عدم الانتهاك، الخلو من فيروسات الكمبيوتر، والضمانات الضمنية الناشئة عن سياق التعامل او سياق الاداء.
                  
                  
                  
                  
سياسة الخصوصية

تصف سياسة الخصوصية هذه سياساتنا وإجراءاتنا المتعلقة بجمع معلوماتك واستخدامها والإفصاح عنها عند استخدامك للخدمة وتخبرك بحقوق الخصوصية الخاصة بك وكيف يحميك القانون.

نستخدم بياناتك الشخصية لتوفير الخدمة وتحسينها. باستخدام الخدمة ، فإنك توافق على جمع واستخدام المعلومات وفقًا لسياسة الخصوصية هذه. تم إنشاء سياسة الخصوصية هذه بمساعدة منشئ سياسة الخصوصية.

التفسير والتعريفات
ترجمة
الكلمات التي يتم كتابة الحرف الأول بها معاني محددة وفقًا للشروط التالية. يجب أن يكون للتعريفات التالية نفس المعنى بغض النظر عما إذا كانت تظهر بصيغة المفرد أو الجمع.

تعريفات
لأغراض سياسة الخصوصية هذه:

الحساب يعني حسابًا فريدًا تم إنشاؤه لك للوصول إلى خدمتنا أو أجزاء من خدمتنا.

الشركة التابعة تعني الكيان الذي يتحكم أو يتحكم فيه أو يخضع لسيطرة مشتركة مع أحد الأطراف ، حيث تعني "السيطرة" ملكية 50٪ أو أكثر من الأسهم أو حقوق الملكية أو الأوراق المالية الأخرى التي يحق لها التصويت لانتخاب أعضاء مجلس الإدارة أو أي سلطة إدارية أخرى .

التطبيق يعني البرنامج الذي توفره الشركة الذي تقوم بتنزيله على أي جهاز إلكتروني يسمى كاراميلا

تشير الشركة (المشار إليها باسم "الشركة" أو "نحن" أو "نحن" أو "لدينا" في هذه الاتفاقية) إلى كاراميلا.

الدولة تشير إلى: الأردن

الجهاز يعني أي جهاز يمكنه الوصول إلى الخدمة مثل جهاز كمبيوتر أو هاتف محمول أو جهاز لوحي رقمي.

البيانات الشخصية هي أي معلومات تتعلق بفرد محدد أو يمكن التعرف عليه.

تشير الخدمة إلى التطبيق.

مقدم الخدمة يعني أي شخص طبيعي أو اعتباري يقوم بمعالجة البيانات نيابة عن الشركة. يشير إلى شركات أو أفراد تابعين لجهات خارجية توظفهم الشركة لتسهيل الخدمة ، لتقديم الخدمة نيابة عن الشركة ، لأداء الخدمات المتعلقة بالخدمة أو لمساعدة الشركة في تحليل كيفية استخدام الخدمة.

تشير بيانات الاستخدام إلى البيانات التي يتم جمعها تلقائيًا ، إما الناتجة عن استخدام الخدمة أو من البنية التحتية للخدمة نفسها (على سبيل المثال ، مدة زيارة الصفحة).

أنت تعني الفرد الذي يصل إلى الخدمة أو يستخدمها ، أو الشركة ، أو الكيان القانوني الآخر الذي يقوم هذا الفرد بالوصول إلى الخدمة أو استخدامها نيابةً عنه ، حسب الاقتضاء.

جمع واستخدام بياناتك الشخصية
أنواع البيانات المجمعة
بيانات شخصية
أثناء استخدام خدمتنا ، قد نطلب منك تزويدنا بمعلومات تعريف شخصية معينة يمكن استخدامها للاتصال بك أو التعرف عليك. قد تتضمن معلومات التعريف الشخصية ، على سبيل المثال لا الحصر:

عنوان البريد الإلكتروني

الاسم الأول واسم العائلة

رقم الهاتف

العنوان ، الولاية ، المقاطعة ، الرمز البريدي / الرمز البريدي ، المدينة

بيانات الاستخدام

بيانات الاستخدام
يتم جمع بيانات الاستخدام تلقائيًا عند استخدام الخدمة.

قد تتضمن بيانات الاستخدام معلومات مثل عنوان بروتوكول الإنترنت الخاص بجهازك (مثل عنوان IP) ، ونوع المتصفح ، وإصدار المتصفح ، وصفحات الخدمة التي تزورها ، ووقت وتاريخ زيارتك ، والوقت الذي تقضيه على تلك الصفحات ، والجهاز الفريد المعرفات والبيانات التشخيصية الأخرى.

عندما تصل إلى الخدمة عن طريق أو من خلال جهاز محمول ، يجوز لنا جمع معلومات معينة تلقائيًا ، بما في ذلك ، على سبيل المثال لا الحصر ، نوع الجهاز المحمول الذي تستخدمه ، والمعرف الفريد لجهازك المحمول ، وعنوان IP لجهازك المحمول ، وهاتفك المحمول نظام التشغيل ، ونوع متصفح الإنترنت على الهاتف المحمول الذي تستخدمه ، ومعرفات الجهاز الفريدة وبيانات التشخيص الأخرى.

قد نقوم أيضًا بجمع المعلومات التي يرسلها متصفحك عندما تزور خدمتنا أو عندما تصل إلى الخدمة عن طريق أو من خلال جهاز محمول.

المعلومات التي تم جمعها أثناء استخدام التطبيق
أثناء استخدام تطبيقنا ، من أجل توفير ميزات تطبيقنا ، قد نجمع ، بإذن مسبق منك:

معلومات بخصوص موقعك

الصور والمعلومات الأخرى من كاميرا جهازك ومكتبة الصور

نستخدم هذه المعلومات لتوفير ميزات خدمتنا ، لتحسين وتخصيص خدمتنا. قد يتم تحميل المعلومات على خوادم الشركة و / أو خادم مزود الخدمة أو قد يتم تخزينها ببساطة على جهازك.

يمكنك تمكين أو تعطيل الوصول إلى هذه المعلومات في أي وقت ، من خلال إعدادات جهازك.

استخدام بياناتك الشخصية
يجوز للشركة استخدام البيانات الشخصية للأغراض التالية:

لتوفير وصيانة خدمتنا ، بما في ذلك مراقبة استخدام خدمتنا.

لإدارة حسابك: لإدارة تسجيلك كمستخدم للخدمة. يمكن أن تمنحك البيانات الشخصية التي تقدمها إمكانية الوصول إلى الوظائف المختلفة للخدمة المتاحة لك كمستخدم مسجل.

لتنفيذ العقد: التطوير والامتثال والتعهد بعقد الشراء للمنتجات أو الأصناف أو الخدمات التي اشتريتها أو أي عقد آخر معنا من خلال الخدمة.

 و الرسائل النصية القصيرة أو غيرها من أشكال الاتصالات الإلكترونية المماثلة ، مثل إخطارات تطبيق الهاتف المحمول فيما يتعلق بالتحديثات أو الاتصالات الإعلامية المتعلقة بالوظائف أو المنتجات أو الخدمات المتعاقد عليها ، بما في ذلك التحديثات الأمنية ، عند الضرورة أو المعقولة لتنفيذها.

لتزويدك بالأخبار والعروض الخاصة والمعلومات العامة حول السلع والخدمات والأحداث الأخرى التي نقدمها والتي تشبه تلك التي اشتريتها بالفعل أو استفسرت عنها ما لم تكن قد اخترت عدم تلقي هذه المعلومات.

لإدارة طلباتك: لحضور وإدارة طلباتك إلينا.

بالنسبة لعمليات نقل الأعمال: قد نستخدم معلوماتك لتقييم أو إجراء عملية اندماج أو تصفية أو إعادة هيكلة أو إعادة تنظيم أو حل أو بيع أو نقل آخر لبعض أو كل أصولنا ، سواء كان ذلك كمنشأة مستمرة أو كجزء من الإفلاس أو التصفية ، أو إجراء مشابه ، حيث تكون البيانات الشخصية التي نحتفظ بها عن مستخدمي خدمتنا من بين الأصول المنقولة.

لأغراض أخرى: قد نستخدم معلوماتك لأغراض أخرى ، مثل تحليل البيانات ، وتحديد اتجاهات الاستخدام ، وتحديد فعالية حملاتنا الترويجية ولتقييم وتحسين خدماتنا ومنتجاتنا وخدماتنا وتسويقنا وتجربتك.

قد نشارك معلوماتك الشخصية في المواقف التالية:

مع مزودي الخدمة: قد نشارك معلوماتك الشخصية مع مزودي الخدمة لمراقبة وتحليل استخدام خدمتنا ، للتواصل معك.
لنقل الأعمال: يجوز لنا مشاركة معلوماتك الشخصية أو نقلها فيما يتعلق أو أثناء المفاوضات بشأن أي اندماج أو بيع أصول الشركة أو تمويل أو الاستحواذ على كل أو جزء من أعمالنا إلى شركة أخرى.
مع الشركات التابعة: قد نشارك معلوماتك مع الشركات التابعة لنا ، وفي هذه الحالة سنطلب من تلك الشركات التابعة احترام سياسة الخصوصية هذه. تشمل الشركات التابعة شركتنا الأم وأي شركات فرعية أخرى أو شركاء في المشاريع المشتركة أو شركات أخرى نسيطر عليها أو تخضع لسيطرة مشتركة معنا.
مع شركاء الأعمال: قد نشارك معلوماتك مع شركائنا في العمل لنقدم لك منتجات أو خدمات أو عروض ترويجية معينة.
مع مستخدمين آخرين: عندما تشارك معلومات شخصية أو تتفاعل بطريقة أخرى في المناطق العامة مع مستخدمين آخرين ، فقد يتم عرض هذه المعلومات من قبل جميع المستخدمين ويمكن توزيعها علنًا في الخارج.
بموافقتك: يجوز لنا الكشف عن معلوماتك الشخصية لأي غرض آخر بموافقتك.
الاحتفاظ ببياناتك الشخصية
ستحتفظ الشركة ببياناتك الشخصية فقط طالما كان ذلك ضروريًا للأغراض المنصوص عليها في سياسة الخصوصية هذه. سنحتفظ ببياناتك الشخصية ونستخدمها بالقدر اللازم للامتثال لالتزاماتنا القانونية (على سبيل المثال ، إذا طُلب منا الاحتفاظ ببياناتك للامتثال للقوانين المعمول بها) ، وحل النزاعات ، وفرض اتفاقياتنا وسياساتنا القانونية.

ستحتفظ الشركة أيضًا ببيانات الاستخدام لأغراض التحليل الداخلي. يتم الاحتفاظ ببيانات الاستخدام عمومًا لفترة زمنية أقصر ، إلا في حالة استخدام هذه البيانات لتعزيز الأمن أو لتحسين وظائف خدمتنا ، أو نحن ملزمون قانونًا بالاحتفاظ بهذه البيانات لفترات زمنية أطول.

نقل بياناتك الشخصية
تتم معالجة معلوماتك ، بما في ذلك البيانات الشخصية ، في مكاتب تشغيل الشركة وفي أي أماكن أخرى حيث توجد الأطراف المشاركة في المعالجة. هذا يعني أنه قد يتم نقل هذه المعلومات إلى أجهزة الكمبيوتر الموجودة خارج ولايتك أو مقاطعتك أو بلدك أو أي ولاية قضائية حكومية أخرى - حيث قد تختلف قوانين حماية البيانات عن تلك الموجودة في ولايتك القضائية.

موافقتك على سياسة الخصوصية هذه متبوعة بتقديمك لهذه المعلومات يمثل موافقتك على هذا النقل.

ستتخذ الشركة جميع الخطوات اللازمة بشكل معقول لضمان التعامل مع بياناتك بشكل آمن ووفقًا لسياسة الخصوصية هذه ولن يتم نقل بياناتك الشخصية إلى منظمة أو دولة ما لم تكن هناك ضوابط كافية في مكانها بما في ذلك أمن بياناتك ومعلوماتك الشخصية الأخرى.

الإفصاح عن بياناتك الشخصية
المعاملات التجارية
إذا كانت الشركة متورطة في عملية دمج أو استحواذ أو بيع أصول ، فقد يتم نقل بياناتك الشخصية. سنقدم إشعارًا قبل نقل بياناتك الشخصية وإخضاعها لسياسة خصوصية مختلفة.

تطبيق القانون
في ظل ظروف معينة ، قد يُطلب من الشركة الكشف عن بياناتك الشخصية إذا طُلب منها ذلك بموجب القانون أو استجابة لطلبات صحيحة من قبل السلطات العامة (على سبيل المثال ، محكمة أو وكالة حكومية).

المتطلبات القانونية الأخرى
قد تفصح الشركة عن بياناتك الشخصية بحسن نية أن هذا الإجراء ضروري من أجل:

الامتثال لالتزام قانوني
حماية والدفاع عن حقوق أو ممتلكات الشركة
منع أو التحقيق في أي مخالفات محتملة تتعلق بالخدمة
حماية السلامة الشخصية لمستخدمي الخدمة أو الجمهور
يحمي 
ضد المسؤولية القانونية
أمن بياناتك الشخصية
يعد أمان بياناتك الشخصية أمرًا مهمًا بالنسبة لنا ، ولكن تذكر أنه لا توجد طريقة نقل عبر الإنترنت أو طريقة تخزين إلكتروني آمنة بنسبة 100٪. بينما نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك الشخصية ، لا يمكننا ضمان أمنها المطلق.

خصوصية الأطفال
لا تخاطب خدمتنا أي شخص يقل عمره عن 13 عامًا ، فنحن لا نجمع عن قصد معلومات تعريف شخصية من أي شخص يقل عمره عن 13 عامًا. إذا كنت أحد الوالدين أو وصيًا وأنت تعلم أن طفلك قد زودنا ببيانات شخصية ، من فضلك اتصل بنا. إذا علمنا أننا جمعنا بيانات شخصية من أي شخص يقل عمره عن 13 عامًا دون التحقق من موافقة الوالدين ، فإننا نتخذ خطوات لإزالة هذه المعلومات من خوادمنا.

إذا احتجنا إلى الاعتماد على الموافقة كأساس قانوني لمعالجة معلوماتك وطلب بلدك موافقة أحد الوالدين ، فقد نطلب موافقة والديك قبل أن نجمع هذه المعلومات ونستخدمها.

روابط لمواقع أخرى
قد تحتوي خدمتنا على روابط لمواقع أخرى لا نقوم بتشغيلها. إذا قمت بالنقر فوق ارتباط جهة خارجية ، فسيتم توجيهك إلى موقع الطرف الثالث. ننصحك بشدة بمراجعة سياسة الخصوصية لكل موقع تزوره.

ليس لدينا أي سيطرة ولا نتحمل أي مسؤولية عن المحتوى أو سياسات الخصوصية أو الممارسات الخاصة بأي مواقع أو خدمات خاصة بطرف ثالث.

التغييرات على سياسة الخصوصية هذه
قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.

سنخبرك عبر البريد الإلكتروني و / أو إشعارًا بارزًا على خدمتنا ، قبل أن يصبح التغيير ساريًا وتحديث تاريخ "آخر تحديث" في الجزء العلوي من سياسة الخصوصية هذه.

يُنصح بمراجعة سياسة الخصوصية هذه بشكل دوري لمعرفة أي تغييرات. تسري التغييرات التي تطرأ على سياسة الخصوصية هذه عند نشرها على هذه الصفحة.

اتصل بنا
إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه ، يمكنك الاتصال بنا:

عن طريق البريد الإلكتروني:
 Caramellaapplication@gmail.com
Caramella سياسة الخصوصية الخاصة بـ 
 للاتصال بك: للاتصال بك عن طريق البريد الإلكتروني والمكالمات الهاتفية 



                  
                  
                  
                  """




                ),
                SizedBox(height: 200,),
                Center(
                    child: Text('  بالضغط علي موافق فأنت تقر بموافقتك على كل الشروط والأحكام وسياية الخصوصية الخاصة بالبرنامج'),
                    )
                ],


              )


            ),)

          ).show()

        });
      }

    }






  }


  sendverifyemail(TextEditingController email) {



  }
}

class BezierContainer extends StatelessWidget {
  const BezierContainer({Key key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Container(
        child: Transform.rotate(
      angle: -pi / 3.5,
      child: ClipPath(
        clipper: ClipPainter(),
        child: Container(
          height: MediaQuery.of(context).size.height * .5,
          width: MediaQuery.of(context).size.width,
          decoration: BoxDecoration(
              gradient: LinearGradient(
                  begin: Alignment.topCenter,
                  end: Alignment.bottomCenter,
                  colors: [klight, kdark])),
        ),
      ),
    ));
  }
}

class ClipPainter extends CustomClipper<Path> {
  @override
  Path getClip(Size size) {
    var height = size.height;
    var width = size.width;
    var path = new Path();

    path.lineTo(0, size.height);
    path.lineTo(size.width, height);
    path.lineTo(size.width, 0);

    /// [Top Left corner]
    var secondControlPoint = Offset(0, 0);
    var secondEndPoint = Offset(width * .1, height * .4);
    path.quadraticBezierTo(secondControlPoint.dx, secondControlPoint.dy,
        secondEndPoint.dx, secondEndPoint.dy);

    /// [Left Middle]
    var fifthControlPoint = Offset(width * .3, height * .5);
    var fiftEndPoint = Offset(width * .23, height * .6);
    path.quadraticBezierTo(fifthControlPoint.dx, fifthControlPoint.dy,
        fiftEndPoint.dx, fiftEndPoint.dy);

    /// [Bottom Left corner]
    var thirdControlPoint = Offset(0, height);
    var thirdEndPoint = Offset(width, height);
    path.quadraticBezierTo(thirdControlPoint.dx, thirdControlPoint.dy,
        thirdEndPoint.dx, thirdEndPoint.dy);

    path.lineTo(0, size.height);
    path.close();

    return path;
  }

  @override
  bool shouldReclip(CustomClipper<Path> oldClipper) {
    // TODO: implement shouldReclip
    return true;
  }
}
